In [19]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine('postgresql://root:root@postgres:5432/ny_taxi')
engine.connect()

In [20]:
query3 = """
SELECT 
    COUNT(CASE WHEN trip_distance <= 1 THEN 1 END) as "up_to_1_mile",
    COUNT(CASE WHEN trip_distance > 1 AND trip_distance <= 3 THEN 1 END) as "1_to_3_miles",
    COUNT(CASE WHEN trip_distance > 3 AND trip_distance <= 7 THEN 1 END) as "3_to_7_miles",
    COUNT(CASE WHEN trip_distance > 7 AND trip_distance <= 10 THEN 1 END) as "7_to_10_miles",
    COUNT(CASE WHEN trip_distance > 10 THEN 1 END) as "over_10_miles"
FROM green_taxi_trips
WHERE lpep_pickup_datetime >= '2019-10-01' 
    AND lpep_dropoff_datetime < '2019-11-01';
"""

pd.read_sql(query3, con=engine)

   up_to_1_mile  1_to_3_miles  3_to_7_miles  7_to_10_miles  over_10_miles
0        104802        198924        109603          27678          35189

In [21]:
query4 = """
SELECT 
    DATE(lpep_pickup_datetime) as pickup_date,
    MAX(trip_distance) as max_distance
FROM green_taxi_trips 
GROUP BY DATE(lpep_pickup_datetime)
ORDER BY max_distance DESC
LIMIT 1;
"""

pd.read_sql(query4, con=engine)

  pickup_date  max_distance
0  2019-10-31        515.89

In [22]:
query5 = """
SELECT 
    tz."Zone" as pickup_zone,
    SUM(t."total_amount") as total_amount
FROM 
    green_taxi_trips t
    JOIN taxi_zones tz ON t."PULocationID" = tz."LocationID"
WHERE 
    t.lpep_pickup_datetime >= '2019-10-18' 
    AND t.lpep_pickup_datetime < '2019-10-19'
GROUP BY tz."Zone"
HAVING SUM(t."total_amount") > 13000
ORDER BY total_amount DESC;
"""

pd.read_sql(query5, con=engine)

           pickup_zone  total_amount
0    East Harlem North      18686.68
1    East Harlem South      16797.26
2  Morningside Heights      13029.79

In [23]:
query6 = """
SELECT 
    dropoff."Zone" as dropoff_zone,
    MAX(t."tip_amount") as max_tip
FROM 
    green_taxi_trips t
    JOIN taxi_zones pickup 
        ON t."PULocationID" = pickup."LocationID"
    JOIN taxi_zones dropoff 
        ON t."DOLocationID" = dropoff."LocationID"
WHERE 
    DATE(t.lpep_pickup_datetime) >= '2019-10-01'
    AND DATE(t.lpep_pickup_datetime) < '2019-11-01'
    AND pickup."Zone" = 'East Harlem North'
GROUP BY 
    dropoff."Zone"
ORDER BY 
    max_tip DESC
LIMIT 1;
"""

pd.read_sql(query6, con=engine)

  dropoff_zone  max_tip
0  JFK Airport     87.3